cf/Catalogs/СпецификацииДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СпецификацииДоговоров</Name>
			<Comment>neti Муталлапова 24.04.2017</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКолебанияЦен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АртикулПоДаннымОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АртикулПоДанымПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПроизводства</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтоговаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтопЗаказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/СпецификацииДоговоров/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

		НаименованиеСпецификации = "Спецификация";
		
		Если ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			Поставщик = ДанныеЗаполнения.Владелец;
			
			Если ДанныеЗаполнения.Владелец.СтраницыСайта.Количество() > 0 Тогда
				Бренд = ДанныеЗаполнения.Владелец.СтраницыСайта[0].Бренд;
			КонецЕсли;
		
			Договор = ДанныеЗаполнения;

			НаименованиеСпецификации = НаименованиеСпецификации 
										+ " " 
										+ ДанныеЗаполнения.Владелец.Наименование
										+ " по договору №"
										+ ДанныеЗаполнения.Наименование;
			
			
		КонецЕсли;
		
		ДатаСоздания = ТекущаяДата();
		Автор = ПараметрыСеанса.ТекущийПользователь;
		СтатусСпецификации = Перечисления.СтатусыСпецификаций.Создана;
		Наименование = НаименованиеСпецификации;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления Тогда 
		СтатусСпецификации = Перечисления.СтатусыСпецификаций.Закрыта;
	КонецЕсли;
	
	ТаблицаНоменклатуры = Состав.Выгрузить(, "Номенклатура");
	ТаблицаНоменклатуры.Колонки.Добавить("КоличествоПозиций");
	
	Для Каждого ТекСтрока Из ТаблицаНоменклатуры Цикл 
		ТекСтрока.КоличествоПозиций = 1;	
	КонецЦикла;	
	
	ТаблицаНоменклатуры.Свернуть("Номенклатура", "КоличествоПозиций");
	
	Для Каждого ТекСтрока Из ТаблицаНоменклатуры Цикл 
		Если ТекСтрока.КоличествоПозиций > 1 Тогда
			Сообщить("Номенклатура " + Строка(ТекСтрока.Номенклатура) + " указана более одного раза!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЭтоНовый() И 
			(Поставщик 	<> Ссылка.Поставщик               
				Или Договор 	<> Ссылка.Договор) Тогда 
			
		ДополнительныеСвойства.Вставить("ЗаписатьСтатус", Истина);	
		
	КонецЕсли;
	
	Если СтатусСпецификации <> Ссылка.СтатусСпецификации Или ПометкаУдаления Тогда 
		ДополнительныеСвойства.Вставить("СменаСтатуса", Истина);
		Если Ссылка.СтатусСпецификации = Перечисления.СтатусыСпецификаций.Активна Или ПометкаУдаления Тогда 
			ДополнительныеСвойства.Вставить("СделатьНеАктивной", Истина);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	 СтатусСпецификации = Перечисления.СтатусыСпецификаций.Создана;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ПеренестиСтопЗаказыВНоменклатуру();
	
КонецПроцедуры

Процедура ПеренестиСтопЗаказыВНоменклатуру()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпецификацииДоговоровСостав.Номенклатура,
	|	СпецификацииДоговоровСостав.СтопЗаказ
	|ИЗ
	|	Справочник.СпецификацииДоговоров.Состав КАК СпецификацииДоговоровСостав
	|ГДЕ
	|	СпецификацииДоговоровСостав.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.Номенклатура.БольшеНеПоставляется <> Выборка.СтопЗаказ Тогда
			НоменклатураОбъект = Выборка.Номенклатура.ПолучитьОбъект();
			НоменклатураОбъект.БольшеНеПоставляется = Выборка.СтопЗаказ;
			НоменклатураОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
